#+begin_src sh :shebang #!/bin/sh :results output 
  git branch aravind_prodigy_dataset
#+end_src

#+RESULTS:

#+begin_src sh :shebang #!/bin/sh :results output 
  git switch aravind_prodigy_dataset
#+end_src

#+RESULTS:
: M	make_latent.py
: Your branch and 'origin/aravind_prodigy_dataset' have diverged,
: and have 2 and 1 different commits each, respectively.
:   (use "git pull" to merge the remote branch into yours)

#+begin_src sh :shebang #!/bin/sh :results output 
  git branch -a
#+end_src

#+RESULTS:
: * aravind_prodigy_dataset
:   fix_batch
:   main
:   remotes/origin/HEAD -> origin/main
:   remotes/origin/aravind_prodigy_dataset
:   remotes/origin/fix_batch
:   remotes/origin/main

#+begin_src conf :tangle ./git_add.txt
  docker/build.sh
  docker/default_config.yaml
  docker/default_config.yaml.aggressive
  docker/default_config.yaml.bad
  docker/default_config.yaml.good
  docker/default_config.yaml.new
  docker/default_config.yaml.new2
  docker/Dockerfile
  docker/important_functions.sh
  docker/README.org
  docker/run_interactive.sh
  docker/run.sh
  docker/train.sh
  .gitignore
  image_datasets/canny_dataset.py
  image_datasets/dataset.py
  main.org
  make_latent_2.py
  make_latent.py
  new/train_flux_lora_deepspeed.org
  train_flux_controlnet_deepspeed_cached.py
  train_flux_deepspeed_controlnet_aravind.py
  train_flux_lora_controlnet_deepspeed_cached.py
  train_flux_lora_deepspeed_cached.py
  train_flux_lora_deepspeed.py
#+end_src

#+begin_src conf :tangle ./rm.txt
  git_add.txt
  gitignore
  image_datasets/.dataset.py.~undo-tree~
  #main.org#
  .#main.org
  main.org~
  .main.org.~undo-tree~
  make_latent.py~
  .make_latent.py.~undo-tree~
  rm.txt
  .train_flux_lora_deepspeed.py.~undo-tree~
  work.sh
  .train_flux_lora_deepspeed_cached.py.~undo-tree~
  train_flux_lora_deepspeed_cached.py~
  .make_latent_2.py.~undo-tree~
  make_latent_2.py~
  image_datasets/.canny_dataset.py.~undo-tree~
  .train_flux_lora_controlnet_deepspeed_cached.py.~undo-tree~
  train_flux_lora_controlnet_deepspeed_cached.py~
  .train_flux_deepspeed_controlnet.py.~undo-tree~
  docker/#README.org#
  docker/.README.org.~undo-tree~
  .train_flux_controlnet_deepspeed_cached.py.~undo-tree~
  .train_flux_deepspeed_controlnet_aravind.py.~undo-tree~
  train_flux_deepspeed_controlnet_aravind.py~
#+end_src

#+begin_src conf :tangle ./gitignore
  # Byte-compiled / optimized / DLL files
  __pycache__/
  ,*.py[cod]
  ,*$py.class

  # C extensions
  ,*.so

  # Distribution / packaging
  .Python
  Makefile
  build/
  develop-eggs/
  dist/
  downloads/
  eggs/
  .eggs/
  lib/
  lib64/
  parts/
  sdist/
  var/
  wheels/
  weights/

  share/python-wheels/
  ,*.egg-info/
  .installed.cfg
  ,*.egg
  MANIFEST

  # PyInstaller
  #  Usually these files are written by a python script from a template
  #  before PyInstaller builds the exe, so as to inject date/other infos into it.
  ,*.manifest
  ,*.spec

  # Installer logs
  pip-log.txt
  pip-delete-this-directory.txt

  # Unit test / coverage reports
  htmlcov/
  .tox/
  .nox/
  .coverage
  .coverage.*
  .cache/
  nosetests.xml
  coverage.xml
  ,*.cover
  ,*.py,cover
  .hypothesis/
  .pytest_cache/
  cover/

  # Translations
  ,*.mo
  ,*.pot

  # Django stuff:
  ,*.log
  local_settings.py
  db.sqlite3
  db.sqlite3-journal

  # Flask stuff:
  instance/
  .webassets-cache

  # Scrapy stuff:
  .scrapy

  # Sphinx documentation
  docs/_build/

  # PyBuilder
  .pybuilder/
  target/

  # Jupyter Notebook
  .ipynb_checkpoints

  # IPython
  profile_default/
  ipython_config.py

  # pyenv
  #   For a library or package, you might want to ignore these files since the code is
  #   intended to run in multiple environments; otherwise, check them in:
  # .python-version

  # pipenv
  #   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.
  #   However, in case of collaboration, if having platform-specific dependencies or dependencies
  #   having no cross-platform support, pipenv may install dependencies that don't work, or not
  #   install all needed dependencies.
  #Pipfile.lock

  # poetry
  #   Similar to Pipfile.lock, it is generally recommended to include poetry.lock in version control.
  #   This is especially recommended for binary packages to ensure reproducibility, and is more
  #   commonly ignored for libraries.
  #   https://python-poetry.org/docs/basic-usage/#commit-your-poetrylock-file-to-version-control
  #poetry.lock

  # pdm
  #   Similar to Pipfile.lock, it is generally recommended to include pdm.lock in version control.
  #pdm.lock
  #   pdm stores project-wide configurations in .pdm.toml, but it is recommended to not include it
  #   in version control.
  #   https://pdm.fming.dev/latest/usage/project/#working-with-version-control
  .pdm.toml
  .pdm-python
  .pdm-build/

  # PEP 582; used by e.g. github.com/David-OConnor/pyflow and github.com/pdm-project/pdm
  __pypackages__/

  # Celery stuff
  celerybeat-schedule
  celerybeat.pid

  # SageMath parsed files
  ,*.sage.py

  # Environments
  .env
  .venv
  env/
  venv/
  ENV/
  env.bak/
  venv.bak/

  # Spyder project settings
  .spyderproject
  .spyproject

  # Rope project settings
  .ropeproject

  # mkdocs documentation
  /site

  # mypy
  .mypy_cache/
  .dmypy.json
  dmypy.json

  # Pyre type checker
  .pyre/

  # pytype static type analyzer
  .pytype/

  # Cython debug symbols
  cython_debug/

  # PyCharm
  #  JetBrains specific template is maintained in a separate JetBrains.gitignore that can
  #  be found at https://github.com/github/gitignore/blob/main/Global/JetBrains.gitignore
  #  and can be added to the global gitignore or merged into this file.  For a more nuclear
  #  option (not recommended) you can uncomment the following to ignore the entire idea folder.
  #.idea/

  .DS_Store
#+end_src

#+begin_src sh :shebang #!/bin/sh :results output :tangle ./work.sh
  (sed 's@^@/@g' ./rm.txt ; cat './gitignore') | sort | uniq > ./.gitignore
  'sed' 's@^@("git" "add" "./@g;s@$@");@g' './git_add.txt' | sh
  'sed' 's@^@("rm" "-vf" "--" "./@g;s@$@");@g' './rm.txt' | sh
#+end_src

#+RESULTS:
: removed './.main.org.~undo-tree~'
: removed './git_add.txt'

#+begin_src elisp
  (save-buffer)
  (save-some-buffers)
  (org-babel-tangle)
  (shell-command "./work.sh")
#+end_src

#+RESULTS:
: 0

#+begin_src sh :shebang #!/bin/sh :results output 
  git status
#+end_src

#+RESULTS:
: On branch aravind_prodigy_dataset
: Your branch is up to date with 'origin/aravind_prodigy_dataset'.
: 
: Changes to be committed:
:   (use "git restore --staged <file>..." to unstage)
: 	modified:   main.org
: 	modified:   train_flux_deepspeed_controlnet_aravind.py
: 


#+RESULTS:
: 0

#+begin_src sh :shebang #!/bin/sh :results output 
  git commit -m 'Corrected loader issue'
  ssh-add "${HOME}/.ssh/github10"
  git push --set-upstream origin aravind_prodigy_dataset
#+end_src

#+RESULTS:
: [aravind_prodigy_dataset 48e502c] Corrected loader issue
:  2 files changed, 20 insertions(+), 23 deletions(-)
: Branch 'aravind_prodigy_dataset' set up to track remote branch 'aravind_prodigy_dataset' from 'origin'.

#+begin_src sh :shebang #!/bin/sh :results output 
  git log -n 10
#+end_src

#+RESULTS:
#+begin_example
commit 
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Thu Sep 19 13:01:02 2024 +0530

    Corrected loader issue

commit 44a13429c023c1ccf77e15e131d1cfecb1945dc2
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Thu Sep 19 12:35:49 2024 +0530

    Added new controlnet training code

commit 6880f817b31afec72932a5bf43d6818cec551415
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Tue Sep 17 15:45:21 2024 +0530

    Added only controlnet

commit 66d0cf29d585479830177604eec539e7bf3fd38d
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Tue Sep 17 15:40:45 2024 +0530

    Added only controlnet

commit aedd3343bd9ab548bb698bb5355a5e72cdbc9bbe
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Tue Sep 17 15:34:31 2024 +0530

    Added only controlnet

commit 92b5bf9c7187f504692af99e2bc32d780523f3e5
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Tue Sep 17 15:08:30 2024 +0530

    Added only controlnet

commit 2cb7b1b90d8c9bd3488a14c8a6fe211ead4babce
Author: aravindhv10 <aravindhv10@gmail.com>
Date:   Tue Sep 17 14:45:13 2024 +0530

    Added only controlnet

commit 7887e09f156b47d1f01b95d07dfc39faba196ffd
Author: Apple <apple@Apples-MacBook-Pro.local>
Date:   Tue Sep 17 12:43:33 2024 +0530

    removing lora first batch

commit e3d9dccc4e6345aaebb10b168ea616a402370b96
Author: Apple <apple@Apples-MacBook-Pro.local>
Date:   Tue Sep 17 12:10:03 2024 +0530

    control net only , cached latents

commit ee19ba9fafbc5b4d035751dba8575696a555c0c6
Author: Apple <apple@Apples-MacBook-Pro.local>
Date:   Tue Sep 17 12:06:43 2024 +0530

    control net only , cached latents
#+end_example
